app/Views/admin/dashboard.php

            <div class="card-body">
                <?php
                    $taskModel = new \App\Models\TaskModel();
                    $tasks = $taskModel->where('user_id', $user['id'])->findAll();
---
SELECT *
FROM `tasks`
WHERE `user_id` = '1'