app/Controllers/AuthController.php

    public function login()
{
    $session = session();
    $model = new UserModel();
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');
    $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin123@gmail.com'
 LIMIT 1

    public function register()
{
    $session = session();
    $model = new UserModel();

    $role = $this->request->getPost('role');
    $regCode = $this->request->getPost('reg_code');
    $validCode = 'MYSECRET2024';
    if ($role === 'admin' && $regCode !== $validCode) {
        return redirect()->back()->withInput()->with('error', 'Invalid registration code.');
    }

    // Get form data
    $data = [
        'username'   => $this->request->getPost('username'),
        'email'      => $this->request->getPost('email'),
        'password'   => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        'role'       => $role,
        'created_at' => date('Y-m-d H:i:s')
    ];

    $model->insert($data);

    // Get inserted user and set session
    $user = $model->where('email', $data['email'])->first();
---
INSERT INTO `users` (`username`, `email`, `password`, `role`, `created_at`) VALUES ('admin124', 'admin124@gmail.com', '$2y$10$e.rUL.QbwFge805DOZICFOnUbvIuyKo/xbTnUK7dB2YLPaYtTrzdu', 'admin', '2025-06-19 17:03:11')
SELECT *
FROM `users`
WHERE `email` = 'admin124@gmail.com'
 LIMIT 1