app/Controllers/TaskController.php

SELECT *
FROM `tasks`
WHERE `user_id` = '13'
---
    public function index()
    {
        $this->checkAuth();

        $model = new TaskModel();
        $tasks = $model->where('user_id', session()->get('user_id'))->findAll();

INSERT INTO `tasks` (`user_id`, `title`, `description`, `status`, `priority`, `due_date`, `attachment`, `created_at`) VALUES ('12', 'User124 task', 'task to ni user124', 'In Progress', 'Medium', '2025-06-21T04:08', '1750352699_30c31216473b4dd50674.jpg', '2025-06-19 17:04:59')
---
    public function store()
    {
        $this->checkAuth();

        $validationRules = [
            'title'       => 'required|max_length[255]',
            'description' => 'required',
            'status'      => 'required|in_list[Pending,In Progress,Completed]',
            'priority'    => 'required|in_list[Low,Medium,High]',
            'due_date'    => 'required',
            'attachment'  => 'permit_empty|uploaded[attachment]|max_size[attachment,2048]|ext_in[attachment,jpg,jpeg,png,pdf,doc,docx]'
        ];

        if (!$this->validate($validationRules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $file = $this->request->getFile('attachment');
        $fileName = null;

        if ($file && $file->isValid() && !$file->hasMoved()) {
            $fileName = $file->getRandomName();
            $file->move(FCPATH . 'uploads/', $fileName);
        }

        $model = new TaskModel();
        $model->insert([
            'user_id'     => session()->get('user_id'),
            'title'       => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'status'      => $this->request->getPost('status'),
            'priority'    => $this->request->getPost('priority'),
            'due_date'    => $this->request->getPost('due_date'),
            'attachment'  => $fileName,
            'created_at'  => date('Y-m-d H:i:s'),
        ]);

SELECT *
FROM `users`
---
    public function adminDashboard()
{
    $this->checkAuth();

    if (session()->get('role') !== 'admin') {
        return redirect()->to('/tasks');
    }

    $userModel = new \App\Models\UserModel();
    $users = $userModel->findAll();

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '8'
---
    public function adminViewTask($id)
{
    $this->checkAuth();

    if (session()->get('role') !== 'admin') {
        return redirect()->to('/tasks')->with('error', 'Unauthorized access.');
    }

    $model = new \App\Models\TaskModel();
    $task = $model->find($id);

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '8'
---
    public function adminEditTask($id)
    {
        $this->checkAuth();

        if (session()->get('role') !== 'admin') {
            return redirect()->to('/tasks')->with('error', 'Unauthorized access.');
        }

        $model = new \App\Models\TaskModel();
        $task = $model->find($id);

SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '8'
UPDATE `tasks` SET `title` = 'peksyur ni johanne', `description` = 'johanne', `status` = 'in_progress', `due_date` = '2025-06-21', `updated_at` = '2025-06-20 12:07:32'
WHERE `tasks`.`id` IN ('8')
---
    public function adminUpdateTask($id)
    {
        $this->checkAuth();

        if (session()->get('role') !== 'admin') {
            return redirect()->to('/tasks')->with('error', 'Unauthorized access.');
        }

        $model = new \App\Models\TaskModel();
        $task = $model->find($id);

        if (!$task) {
            return redirect()->to('/admin/dashboard')->with('error', 'Task not found.');
        }

        $validationRules = [
            'title'       => 'required|max_length[255]',
            'description' => 'required',
            'status'      => 'required|in_list[pending,in_progress,completed]',
            'due_date'    => 'required'
        ];

        if (!$this->validate($validationRules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $model->update($id, [
            'title'       => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'status'      => $this->request->getPost('status'),
            'due_date'    => $this->request->getPost('due_date'),
            'updated_at'  => date('Y-m-d H:i:s'),
        ]);